doc: improve documentation
- Updated `concurrently` to version 9.2.1 in both `package.json` and `package-lock.json`.
- Upgraded various dependencies in `package-lock.json`, including:
  - `@babel/parser` to 7.28.3
  - `@vue` packages to 3.5.21
  - `element-plus` to 2.11.1
  - `sass` to 1.92.0
  - `rxjs` to 7.8.2
  - `magic-string` to 0.30.18
  - `pkg-types` to 2.3.0
  - `quansync` to 0.2.11
  - `vite` to 7.1.4
- Enhanced ALL docs.
